DiplomT/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

DiplomT/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomT/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьАкты(Команда)

	Объект.СписокДокументов.Очистить();
	ДлительнаяОперацияАкты = ВыполнитьДлительнуюОперациюАктыНаСервере();

	ОповещенияОперации = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияАкты, ОповещенияОперации, );

КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюАктыНаСервере()

	ДлительнаяОперацияАктов = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"ВКМ_ДлительнаяОперацияСозданияАктов.МассовоеСозданиеАктовСервер", , , , , , , );

	Возврат ДлительнаяОперацияАктов;
КонецФункции

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	СозданиеДокумента(Результат.АдресРезультата);
КонецПроцедуры

&НаСервере
Процедура СозданиеДокумента(РезультатАдрес)
	РезультатОперации = ПолучитьИзВременногоХранилища(РезультатАдрес);
	Выборка = РезультатОперации.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.Договор = Выборка.СсылкаДоговор;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Комментарий = "Документ создан автоматически";

			НовыйДокумент.Записать();

			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			
			НовСтрока = Объект.СписокДокументов.добавить();
			НовСтрока.Договор = НовыйДокумент.Договор;
			НовСтрока.Реализация = НовыйДокумент.Ссылка;
		Иначе
			НовСтрока = Объект.СписокДокументов.добавить();
			НовСтрока.Договор = Выборка.Договор;
			НовСтрока.Реализация = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
